---
title: Partie 21 - L'analyse dynamique - analyser les registres et la m√©moire (3/4)
date: 2023-10-10 10:00:00
categories: [Reverse, Introduction au reverse]
tags: [x86, reverse, linux]     # TAG names should always be lowercase
author: kabeche
toc: true
---

# L'analyse dynamique : üìñ analyser les registres et la m√©moire (3/4)

D√©sormais, nous savons comment avancer dans gdb que ce soit **pas √† pas** ou plus **rapidement**.

Un autre point fort des **d√©bogueurs** est qu'ils ont **acc√®s √† la m√©moire** du processus d√©bogu√©. Vous l'aurez compris, il existe donc des moyens d'**afficher** des zones m√©moire.

Mais il va falloir faire attention √† plusieurs choses :

- comment afficher une zone m√©moire ? en hexad√©cimal ? en *string* ? en d√©cimal ?
- comment afficher les donn√©es en m√©moire ? octet par octet ? par groupe de 4 octets ? 

Nous verrons comment faire pour g√©rer tout cela.

## üìÑ Afficher une valeur

Commen√ßons par la commande la plus simple pour afficher une valeur : `print`.

> **Astuce gdb** : La commande `p` (ou `print`) permet d'afficher une valeur quelconque ou la valeur d'une registre.
> 
> Si la valeur √† afficher est une adresse (ou pointeur), elle ne sera pas d√©r√©f√©renc√©e.
{: .prompt-tip }

Pour comprendre comment fonctionne `print`, chargeons le programme dans gdb et mettons un unique point d'arr√™t dans la fonction `calcul`. Lan√ßons l'ex√©cution, elle s'arr√™tera ici :

![](/assets/images/introduction_au_reverse/stop_run_bp.png)

### Afficher un registre

Premi√®re chose que l'on peut faire est d'afficher les arguments de la fonction. Comme nous sommes en 64 bits, ils sont stock√©s dans `rdi`,`rsi` et `rdx`.

> Mais on les voit d√©j√† dans l'interface ü§® !
{: .prompt-info }

C'est vrai qu'ici ce n'est pas ce qu'il y a de plus utile. Par contre, on observe dans le code assembleur que ce sont plus pr√©cis√©ment les registres `edi`,`esi` et `edx` qui sont utilis√©s. Essayons d'afficher leur contenu m√™me si on peut le deviner √† partir de l'interface.

> **Astuce gdb** : Pour afficher un registre, il suffit de le pr√©fixer avec le signe `$`. Exemple : `print $reg`.
{: .prompt-tip }

On a alors :

```sh
pwndbg> p $edi  
$1 = 1  
pwndbg> p $esi  
$2 = 2  
pwndbg> p $edx  
$3 = 3
```

> Vous remarquerez que gdb stocke les r√©sultats affich√©s dans des variables du type `$1`, `$2` etc. qui pourront √™tre affich√©es √† leur tour en faisant, par exemple, `p $1`.
{: .prompt-tip }

Ce qui est pas mal est que l'on n'est pas limit√©s aux registres affich√©s dans l'interface. On peut √©galement afficher les registres de taille inf√©rieure (ou sous-registres) comme `ax`, `al`, `ah` ...

### Afficher un symbole

Lorsqu'un programme n'est pas *stripp√©* ou que, tout simplement, il fait appel √† des fonctions externes, il est possible d'afficher leur adresse avec `print`.

Gr√¢ce √† `pwndbg`, nous pouvons m√™me afficher les adresses des fonctions de la libc que l'on a pas appel√©es dans notre programme.

> Mais √ßa sert √† quoi d'afficher leur adresse si on ne les appelle pas ? üôÑ
{: .prompt-info }

Eh bien quand on fait de **l'exploitation de binaire** (ou *pwn*), on veut faire en sorte que le programme saute √† n'importe qu'elle adresse. Ainsi, en le faisant sauter sur `execve`, par exemple, il est possible d'ouvrir un *shell* sur la machine de la victime üòà.

Pour afficher l'adresse d'une fonction dont le symbole est pr√©sent dans le programme, il suffit de faire `print fonction`. Par exemple :

![](/assets/images/introduction_au_reverse/main_execve.png)

> La fonction `main` et `execve` ont des adresses tr√®s √©loign√©es car elle ne sont pas charg√©es au m√™me endroit dans la m√©moire.
{: .prompt-tip }

Il est √©galement possible d'afficher le contenu (instructions assembleur) d'une fonction.

> **Astuce gdb** : La commande `disass fun` (ou `disassemble`) permet d'afficher les instructions de la fonction `fun`.
{: .prompt-tip }

Exemple :

![](/assets/images/introduction_au_reverse/disass.png)

En ce qui concerne les **variable globales**, je vous propose de compiler le code suivant et de l'ouvrir dans gdb :

```cpp
int var_a = 5;  
unsigned long long var_b = 213;  
  
int main()  
{  
 return 1;  
}
```

Pour afficher le contenu de `var_a` nous pouvons faire :
```sh
pwndbg> p var_a  
'var_a' has unknown type; cast it to its declared type
```

On remarque que gdb a besoin de savoir quel est **le type** de la variable √† afficher ( ou vers quel type la **convertir**). Essayons de la sorte :

![](/assets/images/introduction_au_reverse/casts.png)

Finalement ce que veut principalement conna√Ætre gdb est :

- la **taille** de la variable
- si elle est **sign√©e ou non**

En renseignant le type nous pouvons fournir ces **deux informations**.

### Afficher une valeur imm√©diate

Via `print` nous pouvons afficher des valeurs imm√©diates, par exemple : 

```sh
pwndbg> p 1234  
$4 = 1234
```

![](/assets/images/introduction_au_reverse/quelle_indignite.png)

Bon j'avoue que comme √ßa, √ßa a l'air √©clat√© car cela ne fait rien √† part afficher la valeur ... qui est d√©j√† affich√©e.

Pourtant, cela a notamment deux grandes utilit√©s :
1. afficher **le r√©sultat d'un calcul**
2. afficher une valeur dans **diff√©rents syst√®mes de num√©ration** 

En effet, parfois, on n'a pas envie, ou on a la flemme, de faire un calcul de t√™te notamment lorsqu'il y a de l'hexad√©cimal en jeu. Exemple :

```sh
pwndbg> p/x 0x123 * 100 -2  
$8 = 0x71aa
```

> Ici `/x` est un format permettant d'afficher des donn√©es en hexad√©cimal comme on le ferait en C avec `printf("0x%x",0x123*100-2);`. 
{: .prompt-tip }

√áa tombe bien, voyons les formats !

### Les formats

Une fonctionnalit√© tr√®s utile lorsque souhaite afficher des donn√©es est **les formats**.

Cela permet de basculer d'un **syst√®me de num√©ration** √† un autre, d'afficher le caract√®re correspondant √† un nombre en ASCII ...

- **o** : octal
- **x** : hexad√©cimal
- **u** : d√©cimal non sign√©
- **t** : binaire
- **f** : nombre √† virgule (ou flottant)
- **a** : adresse
- **c** : char
- **s** : cha√Æne de caract√®res

Quelques exemples :

```sh
pwndbg> p/x 195948557  
$1 = 0xbadf00d  
pwndbg> p/d 0xbadf00d  
$2 = 195948557  
pwndbg> p/c 0x48  
$3 = 72 'H'
pwndbg> p/t 0x5  
$4 = 101
```

> Si vous souhaitez conna√Ætre plus de fonctionnalit√©s concernant la commande `print`, vous pouvez vous rendre sur cette [page de manuel](https://visualgdb.com/gdbreference/commands/print). 
{: .prompt-tip }

## üîé Examiner la m√©moire

Nous avons vu les diff√©rentes mani√®res d'utiliser `print` afin d'afficher des valeurs. Comme cela a √©t√© mentionn√© pr√©c√©demment, `print` ne **d√©r√©f√©rence pas** l'argument qu'on lui donne, il se contente que de l'afficher ou d'afficher son contenu s'il s'agit d'une **variable** ou d'un **registre**. 

Or, comme vous l'avez sans doute remarqu√©, de nombreux registres pointent vers des zones m√©moire. Ainsi, on aimerait bien, au lieu d'afficher l'adresse point√©e, **afficher le contenu** pr√©sent √† cette adresse. Cela implique donc que l'adresse utilis√©e soit **d√©r√©f√©renc√©e**.

> Quand on analyse une adresse, il faut s'assurer qu'elle est valide et qu'elle pointe bien vers une zone m√©moire accessible sinon gdb va r√¢ler üò†.
{: .prompt-warning }

Voyons donc comment s'en servir.

> **Astuce gdb** : Vous pouvez utiliser le raccourcis `x` ( pour `explore`) afin d'examiner le contenu d'une zone m√©moire.
{: .prompt-tip }

> Ne pas confondre la commande `x` avec le format `/x`.
{: .prompt-warning }

Tout d'abord, il faut savoir que `x` accepte √©galement un format pour afficher le r√©sultat. En guise d'exemple, reprenons notre petit programme qui r√©alise plusieurs appels √† `calcul` et arr√™tons nous √† la premi√®re instruction du `main`.

Comme nous sommes en **64 bits**, les deux premiers arguments `int argc` et `char **argv` sont respectivement stock√©s dans `rdi` et `rsi`.

Pour ce qui est de `rdi`, comme `argc` n'est pas un pointeur, si on tente de l'examiner, gdb va r√¢ler :

```sh
pwndbg> x/x $rdi  
0x1:    Cannot access memory at address 0x1
```

Maintenant examinons le contenu de `rsi` :

```sh
pwndbg> x/x $rsi  
0x7fffffffddd8: 0xffffe15c
```

Le contenu de `rsi` (dans mon cas) est bien `0x7fffffffddd8` qui pointe vers `0x7fffffffe15c`. Mais comme vous pouvez le constater, gdb n'a affich√© que **les 4 octets** de poids faible au lieu d'afficher les 8. 

Pas de soucis ! Nous allons pouvoir y rem√©dier en sp√©cifiant la taille du r√©sultat.

### üî¢ L'usage de diff√©rentes taille

J'ai une **bonne** et une **mauvaise** nouvelle.

üü¢ La **bonne nouvelle** est que si vous vous souvenez du chapitre des tailles de donn√©es (`byte`, `word`, `dword`, `qword` ...) vous allez pouvoir comprendre cette partie assez vite.

üî¥ La **mauvaise nouvelle** est que gdb utilise des tailles qui ne sont pas en ad√©quations avec celles que l'on a vues et qui sont utilis√©s par IDA, Ghidra, objdump ...

Voici les **tailles** d√©finies dans gdb :

| Abr√©viation | Signification | Taille (en octets) |
|-------------|---------------|--------------------|
| `b`           | *byte*          | 1                  |
| `h`           | *half word*     | 2                  |
| `w`           | *word*          | 4                  |
| `g`           | *giant word*    | 8                  |

Pour ne pas se tromper avec la mani√®re dont sont appel√©es les tailles de donn√©es, il suffit de se rappeler de ceci :

- Pour **gdb** : un word = 4Ô∏è‚É£ octets
- Pour **les autres** : un word = 2Ô∏è‚É£ octets

Reprenons le pr√©c√©dent exemple pour afficher l'adresse point√©e par `rsi` :

```sh
pwndbg> x/xg $rsi    
0x7fffffffddd8: 0x00007fffffffe15c
```

Voil√† !

> **Astuce gdb** : Vous pouvez sp√©cifier un nombre d'√©l√©ments √† afficher avant les formats afin d'afficher plus ou moins de donn√©es en m√©moire. 
{: .prompt-tip }

> Le **nombre d'√©l√©ments** √† afficher ainsi que **la taille** ne sont utilisables qu'avec `x`. Cela ne **fonctionnera pas** avec `print` o√π seuls les formats (d√©cimal, binaire, hexad√©cimal ...) sont utilisables.
{: .prompt-warning }

Pour afficher les 8 √©l√©ments apr√®s `0x7fffffffddd8` nous pouvons faire ceci :

```sh
pwndbg> x/8xg $rsi    
0x7fffffffddd8: 0x00007fffffffe15c      0x0000000000000000  
0x7fffffffdde8: 0x00007fffffffe1a8      0x00007fffffffe1b7  
0x7fffffffddf8: 0x00007fffffffe1cb      0x00007fffffffe201  
0x7fffffffde08: 0x00007fffffffe218      0x00007fffffffe223
```

La premi√®re ligne contient l'adresse de `argv[0]` qui pointe vers le chemin du programme :

```sh
pwndbg> x/s 0x00007fffffffe15c  
0x7fffffffe15c: "/home/(...)/exe"
```

Pour rappel, comme nous sommes en *little endian*, voici comment sont **agenc√©es** les adresses m√©moire dans ce qui est affich√© :

![](/assets/images/introduction_au_reverse/gdb_mem.png)

Il est important de bien comprendre cet agencement car, certes, au d√©but ce n'est pas √©vident de se repr√©senter ce vers quoi chaque adresse pointe. Toutefois, en prenant le temps d'assimiler cette disposition, c'est du **temps de gagn√©** par la suite lorsque vous voudrez modifier une zone m√©moire. En effet, il faudra savoir exactement l'adresse √† utiliser pour ne pas modifier la m√©moire qui est autour.

Autre **point important**, si vous afficher une zone m√©moire **en octets**, le **boutisme n'a plus de sens** auquel cas les donn√©es se lisent de gauche √† droite :

![](/assets/images/introduction_au_reverse/gdb_mem_bytes.png)

> **Astuce gdb** : Avec `x`, vous pouvez √©galement donner en argument une expression avec des op√©rations (addition, soustraction, multiplication ...).
> 
> Cela peut √™tre pratique pour afficher une donn√©e dans un tableau dont on connait l'index et l'adresse de base. Par exemple, pour afficher la 5√®me case d'un tableau d'√©l√©ments de 64 bits : `x 0x401000+8*5` (en supposant que le tableau soit stock√© √† partir de l'adresse `0x401000`).
{: .prompt-tip }

### üëÄ Examiner la pile

La commande `x` est tr√®s utile notamment pour afficher un certain **nombre d‚Äô√©l√©ments** sur la pile. Ainsi, si on souhaite afficher les 10 premiers √©l√©ments de la pile, nous pouvons faire :

- En **x86** : `x/10xw $esp`
- En **x86_64** : `x/10xg $rsp`

Pour mieux illustrer mes propos et comprendre comment va √™tre affich√©e la pile dans gdb, compilons notre programme en 32 bits. Ensuite, mettons un point d'arr√™t dans la fonction `calcul` (**apr√®s le prologue**) et lan√ßons l'ex√©cution. Le programme s'arr√™te lors du premier appel qui `calcul(1,2,3);`

Affichons maintenant les 5 premi√®res valeurs de la pile. Vous devriez avoir un affichage semblable √† ceci (avec des adresses diff√©rentes sans doute) :

![](/assets/images/introduction_au_reverse/stack_gdb.png)

Faisons un peu de gymnastique d'esprit pour comprendre comment est **agenc√©e la pile** dans l'affichage. En effet, depuis le d√©but on repr√©sente la pile comme un tableau vertical d'√©l√©ments mais l√†, va falloir nous adapter et nous habituer √† cet affichage.

Alors, vous arrivez √† vous y retrouver ? Bon. Voyons cela de plus pr√®s ensemble :

![](/assets/images/introduction_au_reverse/gdb_pile_details.png)

Comme le fait d'afficher la pile est quelque chose de tr√®s r√©current quand on fait de l'analyse dynamique, autant comprendre comment interpr√©ter l'affichage de gdb, √ßa mange pas de pain  ü•ñ !

> Parfois, lorsque la *stack frame* est tr√®s grande, que l'on peut pas l'afficher en entier dans gdb et que l'on d√©sire afficher les derni√®res valeurs de la pile, il est possible d'utiliser plut√¥t le registre`ebp`/`rbp` afin de n'afficher que ce qui nous int√©resse.
> 
> Par exemple, si on souhaite afficher seulement les 3 derni√®res valeurs de la pile, nous pouvons faire `x/3xw $ebp-4*3` (car un √©l√©ment de la pile fait 4 octets en x86).
{: .prompt-tip }

## üî¶ Chercher des donn√©es en m√©moire

Apr√®s avoir analys√© le programme statiquement, nous pouvons trouver des cha√Ænes de caract√®res ou simplement des valeurs qui semblent √™tre importantes. 

Imaginons qu'en analysant un *crackme* on voit que le *flag* est g√©n√©r√© dans un fonction assez compliqu√© mais qu'ensuite il est ins√©r√© en m√©moire sous la forme `flag{XXXXXXXXXXXX}`. Il pourrait alors √™tre int√©ressant de savoir comment chercher des cha√Ænes de caract√®res en m√©moire.

> **Astuce gdb** : La commande `search` de pwndbg permet de rechercher des motifs en m√©moire.
{: .prompt-tip }

En l'occurrence, nous pourrions faire ceci :

![](/assets/images/introduction_au_reverse/search_pwndbg.png)

Ensuite c'est √† nous de filtrer le r√©sultat afin d'√©liminer les faux positifs.

Si vous souhaitez chercher des valeurs et non pas seulement des cha√Ænes de caract√®res, je vous renvoie vers la [documentation](https://browserpwndbg.readthedocs.io/en/docs/commands/procinfo/search/) de la commande `search` afin d'y voir les diff√©rentes options disponibles.

## üìã Synth√®se

Voil√† ! Vous savez d√©sormais comment lire des donn√©es en m√©moire üòé !

Evidemment, rien de tel qu'un peu d'entra√Ænement afin de se familiariser avec les notions vues lors de ce chapitre :

- Avec `p` on **affiche une valeur** ou le contenu d'un registre ou d'une variable.
- Avec `x` on peut l'**examiner**, c'est-√†-dire la d√©r√©f√©rencer afin d'afficher la valeur point√©e.
- Il est possible **d'afficher la valeur des registres** en les pr√©fixant avec `$`. De plus, les **sous-registres** d'un registre sont utilisables.
- Lorsque des **symboles** (fonctions, variables ...) sont pr√©sents, il est possible de les afficher afin d'avoir quelques informations.
- Diff√©rents **formats** sont utilisables afin de choisir le syst√®me de num√©ration √† utiliser pour afficher le r√©sultat.
- Il est possible de **regrouper des donn√©es** par groupes d'octets en sp√©cifiant une taille. Cependant, le `word` pour gdb est de **4 octets** bien que d'habitude il soit de 2.
- En sp√©cifiant un nombre avant le format et la taille des donn√©es, on choisit le nombre d‚Äô√©l√©ments √† afficher lorsque l'on examine la m√©moire.
- La commande `x` permet, entre autre, d'afficher les premiers √©l√©ments de la pile.
- La commande `search` permet de **chercher un motif** en m√©moire




